# <center><u>Pandas <u> </center>

## 1.[Pandas Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html)

Import pandas and numpy with their aliases

In [2]:
import pandas as pd
import numpy as np

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [3]:
 a = pd.Series([ 100, 200, 300, 400])

Print a, and data type

In [4]:
a

0    100
1    200
2    300
3    400
dtype: int64

Using indexing access the element 300 from the series a.

In [5]:
a[2]

300

What are the values of index for series a?

In [6]:
index = ['c','a','b','d']

Change the index to  ['c', 'a', 'b', 'd']

In [7]:
a = pd.Series([ 100, 200, 300, 400],index = index)
a

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [8]:
a['d']

400

Sort the values wrt to the index and print it

In [9]:
c =a.sort_index(axis=0)
c

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [10]:
b = pd.Series([ 800, 450, 100],index = ['e','f','g'])
b # code here

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [11]:
a = c.append(b)

In [12]:
#print a again after appending b into it
print(a)

a    200
b    300
c    100
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [13]:
a = a.sort_values(ascending = False) #code here
a

e    800
f    450
d    400
b    300
a    200
c    100
g    100
dtype: int64

In [14]:
# print index of a
a.index

Index(['e', 'f', 'd', 'b', 'a', 'c', 'g'], dtype='object')

## 2. [Pandas DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [15]:
df = pd.DataFrame(a)
df

     0
e  800
f  450
d  400
b  300
a  200
c  100
g  100

Point to ponder! Don't you think series a and dataframe df looks alike? But there must be some difference between them. 
Hey buddy think and write your thoughts below.

What is the shape of the datafarme <br>

In [16]:
df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a' ?

In [17]:
df.index

Index(['e', 'f', 'd', 'b', 'a', 'c', 'g'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [18]:
#head
df.head()

     0
e  800
f  450
d  400
b  300
a  200

In [19]:
#tail
df.tail()

     0
d  400
b  300
a  200
c  100
g  100

In [20]:
df.columns

RangeIndex(start=0, stop=1, step=1)

Rename the columns of the dataframe as 'points'

In [21]:
df.columns=['points']
df

   points
e     800
f     450
d     400
b     300
a     200
c     100
g     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [23]:
#Create fruits array
fruits = np.random.choice(['orange','mango','apple'],7)
fruits

array(['apple', 'orange', 'mango', 'orange', 'apple', 'mango', 'orange'],
      dtype='<U6')

The above output might vary based randomness

In [25]:
#Create series fruits out of fruits array
fruits=pd.Series(fruits)
fruits

0     apple
1    orange
2     mango
3    orange
4     apple
5     mango
6    orange
dtype: object

Change the index of fruits to the index of dataframe df

In [26]:
fruits.index=df.index
print(fruits)

e     apple
f    orange
d     mango
b    orange
a     apple
c     mango
g    orange
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits' <br> print the head of the dataframe to verify

In [27]:
df['fruits']=fruits
df.head()

   points  fruits
e     800   apple
f     450  orange
d     400   mango
b     300  orange
a     200   apple

<u>Bonus optional question:</u> <br>
What if we had to changed the index of the dataframe? <br>
Try to add any series to the dataframe with the origianl index (when index of series is not same as to the index of dataframe)

Use series as pd.Series([100,200,300,400,500,600,700]) and try to add it to df with column name Bonus_number.

Bonus marks: 5 points

### Part 2

Create a dataframe  d1 where the columns are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [33]:
city = ['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali'] 
Temperature = [15, 22, 20, 26,-2]
d1 = pd.DataFrame({'city':city,'Temperature':Temperature})
d1

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

Print d1

In [34]:
print(d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [35]:
d1.shape

(5, 2)

Set city = d1['city']

In [36]:
city=d1['city']

print city <br>
What is the type of city.

In [37]:
print(city)

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object

Create another dataframe d2 where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [38]:
city = ['Bengaluru','Coimbatore','Srirangam','pondicherry']
Temperature = [24,35,36,39]
d2 = pd.DataFrame({'city':city,'Temperature':Temperature})
print(d2)

          city  Temperature
0    Bengaluru           24
1   Coimbatore           35
2    Srirangam           36
3  pondicherry           39

print the shape of this dataframe

In [39]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [40]:
d3 = pd.concat([d1,d2])
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengaluru           24
1   Coimbatore           35
2    Srirangam           36
3  pondicherry           39

# fun fact at high level

1. .concat() simply stacks multiple DataFrame together either vertically, or stitches horizontally after aligning on index
2. .merge() first aligns two DataFrame' selected common column(s) or index, and then pick up the remaining columns from the aligned rows of each DataFrame

Do you know about join function? This interesting quest we give to you to find.

Select the part of the dataframe such that it contains cities where temp is less then or equal to 20 <br>
How many cities are there?

In [41]:
d3[d3['Temperature'] <= 20]

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [42]:
d3[d3['Temperature'] >= 35]

          city  Temperature
1   Coimbatore           35
2    Srirangam           36
3  pondicherry           39

## 3. Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [43]:
# write function here
def is_ut(x):
    if x == 'Chandigarh'or x=='Pondicherry' or x=='Delhi':
        return True
    else:
        return False
d3['is_ut']=d3['city'].apply(is_ut)

In [44]:
#print d3
d3

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
0    Bengaluru           24  False
1   Coimbatore           35  False
2    Srirangam           36  False
3  pondicherry           39  False

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [47]:
# write function here
def c_to_f(celsius):
    farenhiet=(celsius*1.8)+32
    return farenhiet

In [48]:
# check  function c_to_f(10)
c_to_f(10)

50.0

In [51]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'
d3['temp_farenhiet']=d3['Temperature'].apply(c_to_f)
d3

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
2       Kanpur           20  False            68.0
3      Chennai           26  False            78.8
4       Manali           -2  False            28.4
0    Bengaluru           24  False            75.2
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  pondicherry           39  False           102.2

## 4. Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [53]:
d3[d3['is_ut']]

         city  Temperature  is_ut  temp_farenhiet
0  Chandigarh           15   True            59.0
1       Delhi           22   True            71.6

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [55]:
d3[d3['temp_farenhiet']>90]

          city  Temperature  is_ut  temp_farenhiet
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  pondicherry           39  False           102.2

Select only the first three rows of the dataframe d1.

In [56]:
d3.iloc[:3]

         city  Temperature  is_ut  temp_farenhiet
0  Chandigarh           15   True            59.0
1       Delhi           22   True            71.6
2      Kanpur           20  False            68.0

Select all the rows and last two columns in the dataframe.

In [58]:
d3.iloc[:,-2:]

   is_ut  temp_farenhiet
0   True            59.0
1   True            71.6
2  False            68.0
3  False            78.8
4  False            28.4
0  False            75.2
1  False            95.0
2  False            96.8
3  False           102.2

## 5. Reading csv file and group by

Read the file 'weather_data.csv' and store it in a pandas dataframe 'df'

In [12]:
df = pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

print the shape and head of the dataframe

In [15]:
print(df.shape)
print(df.head())

(6, 4)
        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

Group the dataframe wrt to 'event' and save the resulting output in a variable named 'g'

In [17]:
g = df.groupby('event')

Print g and  type(g)

In [20]:
print(g)
type(g)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000022C42B30D30>

pandas.core.groupby.generic.DataFrameGroupBy

Iterate over all the temperatures in g and print them

In [28]:
for index, row in df.iterrows():
    print(row['day'], row['temperature'], row['windspeed'],row['event'])

1/1/2017 32 6 Rain
1/2/2017 35 7 Sunny
1/3/2017 28 2 Snow
1/4/2017 24 7 Snow
1/5/2017 32 4 Rain
1/6/2017 31 2 Sunny

Use the describle method on g to get the complete description on it.

In [22]:
g.describe()

      temperature                                               windspeed  \
            count  mean       std   min   25%   50%   75%   max     count
event
Rain          2.0  32.0  0.000000  32.0  32.0  32.0  32.0  32.0       2.0
Snow          2.0  26.0  2.828427  24.0  25.0  26.0  27.0  28.0       2.0
Sunny         2.0  33.0  2.828427  31.0  32.0  33.0  34.0  35.0       2.0


      mean       std  min   25%  50%   75%  max
event
Rain   5.0  1.414214  4.0  4.50  5.0  5.50  6.0
Snow   4.5  3.535534  2.0  3.25  4.5  5.75  7.0
Sunny  4.5  3.535534  2.0  3.25  4.5  5.75  7.0

Create a new column in the dataframe df, named 'hot_temp' which contains True if temp is above 30, else False

In [38]:
#code here to filter df with above condition
df['hot_temp'] = 'Flase'
df.loc[df['temperature'] > 30, 'hot_temp'] = 'True'

In [40]:
# print df
df

        day  temperature  windspeed  event hot_temp
0  1/1/2017           32          6   Rain     True
1  1/2/2017           35          7  Sunny     True
2  1/3/2017           28          2   Snow    Flase
3  1/4/2017           24          7   Snow    Flase
4  1/5/2017           32          4   Rain     True
5  1/6/2017           31          2  Sunny     True

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [30]:
a = pd.date_range(start='2020-01-01',end='2021-04-01')

print a

In [31]:
print(a)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [32]:
len(a)

457

What is the type of a?

In [33]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex